app/controllers/api/v1/drivers_controller.rb

INSERT INTO "drivers" ("name", "email", "phone_number", "license_number", "car_number", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    driver = Driver.new(name: params[:name],
                        email: params[:email],
                        phone_number: params[:phone_number],
                        license_number: params[:license_number],
                        car_number: params[:car_number])
    if driver.save

INSERT INTO "locations" ("driver_id", "longitude", "latitude", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["driver_id", 2], ["longitude", 21.8946], ["latitude", 11.2648], ["created_at", "2021-03-28 18:53:10.869830"], ["updated_at", "2021-03-28 18:53:10.869830"]]
---
  def saveLocation
    location = Location.new
    location.driver_id = params[:id]
    location.longitude = params[:longitude]
    location.latitude = params[:latitude]

      if location.save