app/controllers/api/v1/travellers_controller.rb

  def create
    passengerLocation = Passenger.new
    passengerLocation.latitude = params[:latitude]
    passengerLocation.longitude = params[:longitude]

    if !passengerLocation.longitude.present? || !passengerLocation.latitude.present?
      render json: {"message": "Error"}, status: 400
    else
      Location.all.each do |driver_location|
          loc1 = [passengerLocation.latitude,passengerLocation.longitude]
          loc2 = [driver_location.latitude,driver_location.longitude]
          distance = get_distance(loc1, loc2)
          #render json: {"mess": distance}, status: 200
          if distance <= 7000000
               @driver = Driver.find_by(id: driver_location.driver_id)
               render json: {
                "available_cabs": [
                   @driver.map! do |cabs|
                      {"name": cabs.name,
                      "phone_number": cabs.phone_number,
                      "car_number": cabs.car_number}
                    end
                ]
---
SELECT "locations".* FROM "locations"
SELECT  "drivers".* FROM "drivers" WHERE "drivers"."driver_id" = ? LIMIT ?  [["driver_id", 2], ["LIMIT", 1]]
SELECT "drivers".* FROM "drivers" WHERE (id = 3)